app/operations/presence/confirm_operation.rb

  def find_existing_presence_same_type
    DailyList.for_date(@date)
             .for_type(@list_type)
             .joins(:presences)
             .where(presences: { user: @user, status: 'confirmed' })
             .first&.presences&.find_by(user: @user)
---
SELECT "daily_lists".* FROM "daily_lists" INNER JOIN "presences" ON "presences"."daily_list_id" = "daily_lists"."id" WHERE "daily_lists"."date" = ? AND "daily_lists"."list_type" = ? AND "presences"."user_id" = ? AND "presences"."status" = ? ORDER BY "daily_lists"."id" ASC LIMIT ?  [["date", "2025-09-02"], ["list_type", "ancient"], ["user_id", 5], ["status", "confirmed"], ["LIMIT", 1]]

  def create_presence!
    @presence = Presence.create!(
      user: @user,
      daily_list: @daily_list,
      position: @position,
      source: 'web',
      status: 'confirmed',
      confirmed_at: Time.current
    )
---
INSERT INTO "presences" ("user_id", "daily_list_id", "position", "source", "status", "confirmed_at", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"