app/operations/daily_list/get_current_lists_operation.rb

  def serialize_current_list(list)
    {
      id: list.id,
      date: list.date,
      list_type: list.list_type,
      sequence_number: list.sequence_number,
      display_name: list.display_name,
      status: list.status,
      available_positions: list.available_positions,
      confirmed_players: list.presences.confirmed.includes(:user).map do |presence|
---
SELECT "presences".* FROM "presences" WHERE "presences"."daily_list_id" = ? AND "presences"."status" = ?  [["daily_list_id", 1], ["status", "confirmed"]]

  def find_user_presence_for_list_type(list_type)
    DailyList.for_date(@date)
             .for_type(list_type)
             .joins(:presences)
             .where(presences: { user: @user, status: 'confirmed' })
             .first&.presences&.find_by(user: @user)
---
SELECT "daily_lists".* FROM "daily_lists" INNER JOIN "presences" ON "presences"."daily_list_id" = "daily_lists"."id" WHERE "daily_lists"."date" = ? AND "daily_lists"."list_type" = ? AND "presences"."user_id" = ? AND "presences"."status" = ? ORDER BY "daily_lists"."id" ASC LIMIT ?  [["date", "2025-09-02"], ["list_type", "ancient"], ["user_id", 5], ["status", "confirmed"], ["LIMIT", 1]]

  def calculate_daily_stats
    ancient_lists = DailyList.for_date(@date).for_type('ancient')
    immortal_lists = DailyList.for_date(@date).for_type('immortal')

    {
      ancient_count: ancient_lists.count,
      immortal_count: immortal_lists.count,
      total_players_today: Presence.joins(:daily_list)
                                  .where(daily_lists: { date: @date })
                                  .where(status: 'confirmed')
                                  .count,
      current_sequence: {
---
SELECT COUNT(*) FROM "presences" INNER JOIN "daily_lists" ON "daily_lists"."id" = "presences"."daily_list_id" WHERE "daily_lists"."date" = ? AND "presences"."status" = ?  [["date", "2025-09-02"], ["status", "confirmed"]]

  def get_recent_completed_lists
    DailyList.where(date: (@date - 7.days)..@date)
             .full
             .includes(presences: :user)
             .order(date: :desc, sequence_number: :desc)
             .limit(10)
             .map do |list|
---
SELECT "daily_lists".* FROM "daily_lists" WHERE "daily_lists"."date" BETWEEN ? AND ? AND "daily_lists"."status" = ? ORDER BY "daily_lists"."date" DESC, "daily_lists"."sequence_number" DESC LIMIT ?  [["date", "2025-08-26"], ["date", "2025-09-02"], ["status", "full"], ["LIMIT", 10]]