app/controllers/api/v1/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def register
    # Call Operation directly and manually serialize response
    attributes = params.dig(:data, :attributes) || {}

    # Permit and convert parameters for Operation
    permitted_attributes = attributes.permit!.to_h
    operation_result = Auth::RegisterOperation.call(permitted_attributes)

    if operation_result[:meta][:success]
      # Create user resource for serialization
      user = User.find(operation_result[:data][:user][:id])