app/controllers/api/v1/daily_lists_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def authenticate_user!
    token = request.headers['Authorization']&.gsub('Bearer ', '')
    return render json: { errors: [{ detail: 'Token não fornecido' }] }, status: 401 unless token

    decoded_token = JwtService.decode(token)
    return render json: { errors: [{ detail: 'Token inválido' }] }, status: 401 unless decoded_token

    @current_user = User.find_by(id: decoded_token[:user_id])