app/controllers/api/v1/presences_controller.rb

SELECT "daily_lists".* FROM "daily_lists" INNER JOIN "presences" ON "presences"."daily_list_id" = "daily_lists"."id" WHERE "daily_lists"."date" = ? AND "daily_lists"."list_type" = ? AND "presences"."user_id" = ? AND "presences"."status" = ? ORDER BY "daily_lists"."id" ASC LIMIT ?  [["date", "2025-09-02"], ["list_type", "ancient"], ["user_id", 5], ["status", "confirmed"], ["LIMIT", 1]]
---
  def find_user_presence_for_list_type(list_type)
    DailyList.for_date(Date.current)
             .for_type(list_type)
             .joins(:presences)
             .where(presences: { user: current_user, status: 'confirmed' })
             .first&.presences&.find_by(user: current_user)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def authenticate_user!
    token = request.headers['Authorization']&.gsub('Bearer ', '')
    return render json: { errors: [{ detail: 'Token não fornecido' }] }, status: 401 unless token

    decoded_token = JwtService.decode(token)
    return render json: { errors: [{ detail: 'Token inválido' }] }, status: 401 unless decoded_token

    @current_user = User.find_by(id: decoded_token[:user_id])