app/operations/auth/login_operation.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "teste@teste.com"], ["LIMIT", 1]]
---
  def find_user!
    @user = User.find_by(email: @parsed_params[:email])