app/operations/auth/me_operation.rb

  def find_user_from_token!
    user_id = @decoded_token[:user_id]
    unless user_id
      raise TokenError, 'Token missing user information'
    end

    @user = User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]