app/operations/auth/register_operation.rb

  def check_email_availability!
    if User.exists?(email: @parsed_params[:email])
---
SELECT 1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test@example.com"], ["LIMIT", 1]]

  def check_nickname_availability!
    if User.exists?(nickname: @parsed_params[:nickname])
---
SELECT 1 AS one FROM "users" WHERE "users"."nickname" = ? LIMIT ?  [["nickname", "testuser"], ["LIMIT", 1]]

  def check_phone_availability!
    if User.exists?(phone: @parsed_params[:phone])
---
SELECT 1 AS one FROM "users" WHERE "users"."phone" = ? LIMIT ?  [["phone", "11999999999"], ["LIMIT", 1]]

  def create_user_with_transaction!
    ActiveRecord::Base.transaction do
      @user = User.create!(@parsed_params)
---
INSERT INTO "users" ("email", "nickname", "name", "phone", "rank_medal", "rank_stars", "preferred_position", "positions", "category", "role", "active", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"