app/models/daily_list.rb

  def user_already_confirmed_today?(user)
    self.class.for_date(date)
             .for_type(list_type)
             .joins(:presences)
             .where(presences: { user: user, status: 'confirmed' })
             .exists?
---
SELECT 1 AS one FROM "daily_lists" INNER JOIN "presences" ON "presences"."daily_list_id" = "daily_lists"."id" WHERE "daily_lists"."date" = ? AND "daily_lists"."list_type" = ? AND "presences"."user_id" = ? AND "presences"."status" = ? LIMIT ?  [["date", "2025-09-02"], ["list_type", "ancient"], ["user_id", 5], ["status", "confirmed"], ["LIMIT", 1]]