app/models/presence.rb

  def user_cannot_confirm_multiple_times_same_day_type
    return unless daily_list && user

    existing_confirmation = DailyList.for_date(daily_list.date)
                                    .for_type(daily_list.list_type)
                                    .joins(:presences)
                                    .where(presences: { user: user, status: 'confirmed' })
                                    .where.not(id: daily_list_id)
                                    .exists?
---
SELECT 1 AS one FROM "daily_lists" INNER JOIN "presences" ON "presences"."daily_list_id" = "daily_lists"."id" WHERE "daily_lists"."date" = ? AND "daily_lists"."list_type" = ? AND "presences"."user_id" = ? AND "presences"."status" = ? AND "daily_lists"."id" != ? LIMIT ?  [["date", "2025-09-02"], ["list_type", "ancient"], ["user_id", 5], ["status", "confirmed"], ["id", 1], ["LIMIT", 1]]